/******************************************************************************/
/* 3gpp_ts_23_038.c                                                           */
/******************************************************************************/

#include <sys/types.h>

#include <errno.h>
#include <iconv.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "3gpp_ts_23_038.h"

const u_int16_t gsm_7bit_default_main[] = {
	// 000xxxx
	0x0040,		// @ - 00
	0x00A3,		// £ - 01
	0x0024,		// $ - 02
	0x00A5,		// ¥ - 03
	0x00E8,		// è - 04
	0x00E9,		// é - 05
	0x00F9,		// ù - 06
	0x00EC,		// ì - 07
	0x00F2,		// ò - 08
	0x00E7,		// ç - 09
	0x000A,		// LF- 0A
	0x00D8,		// Ø - 0B
	0x00F8,		// ø - 0C
	0x000D,		// CR- 0D
	0x00C5,		// Å - 0E
	0x00E5,		// å - 0F
	// 001xxxx
	0x0394,		// Δ - 10
	0x005F,		// _ - 11
	0x03A6,		// Φ - 12
	0x0393,		// Γ - 13
	0x039B,		// Λ - 14
	0x03A9,		// Ω - 15
	0x03A0,		// Π - 16
	0x03A8,		// Ψ - 17
	0x03A3,		// Σ - 18
	0x0398,		// Θ - 19
	0x039E,		// Ξ - 1A
	0x001B,		//ESC- 1B
	0x00C6,		// Æ - 1C
	0x00E6,		// æ - 1D
	0x00DF,		// ß - 1E
	0x00C9,		// É - 1F
	// 010xxxx
	0x0020,		// SP- 20
	0x0021,		// ! - 21
	0x0022,		// " - 22
	0x0023,		// # - 23
	0x00A4,		// ¤ - 24
	0x0025,		// % - 25
	0x0026,		// & - 26
	0x0027,		// ' - 27
	0x0028,		// ( - 28
	0x0029,		// ) - 29
	0x002A,		// * - 2A
	0x002B,		// + - 2B
	0x002C,		// , - 2C
	0x002D,		// - - 2D
	0x002E,		// . - 2E
	0x002F,		// / - 2F
	// 011xxxx
	0x0030,		// 0 - 30
	0x0031,		// 1 - 31
	0x0032,		// 2 - 32
	0x0033,		// 3 - 33
	0x0034,		// 4 - 34
	0x0035,		// 5 - 35
	0x0036,		// 6 - 36
	0x0037,		// 7 - 37
	0x0038,		// 8 - 38
	0x0039,		// 9 - 39
	0x003A,		// : - 3A
	0x003B,		// ; - 3B
	0x003C,		// < - 3C
	0x003D,		// = - 3D
	0x003E,		// > - 3E
	0x003F,		// ? - 3F
	// 100xxxx
	0x00A1,		// ¡ - 40
	0x0041,		// A - 41
	0x0042,		// B - 42
	0x0043,		// C - 43
	0x0044,		// D - 44
	0x0045,		// E - 45
	0x0046,		// F - 46
	0x0047,		// G - 47
	0x0048,		// H - 48
	0x0049,		// I - 49
	0x004A,		// J - 4A
	0x004B,		// K - 4B
	0x004C,		// L - 4C
	0x004D,		// M - 4D
	0x004E,		// N - 4E
	0x004F,		// O - 4F
	// 101xxxx
	0x0050,		// P - 50
	0x0051,		// Q - 51
	0x0052,		// R - 52
	0x0053,		// S - 53
	0x0054,		// T - 54
	0x0055,		// U - 55
	0x0056,		// V - 56
	0x0057,		// W - 57
	0x0058,		// X - 58
	0x0059,		// Y - 59
	0x005A,		// Z - 5A
	0x00C4,		// Ä - 5B
	0x00D6,		// Ö - 5C
	0x00D1,		// Ñ - 5D
	0x00DC,		// Ü - 5E
	0x00A7,		// § - 5F
	// 110xxxx
	0x00BF,		// ¿ - 60
	0x0061,		// a - 61
	0x0062,		// b - 62
	0x0063,		// c - 63
	0x0064,		// d - 64
	0x0065,		// e - 65
	0x0066,		// f - 66
	0x0067,		// g - 67
	0x0068,		// h - 68
	0x0069,		// i - 69
	0x006A,		// j - 6A
	0x006B,		// k - 6B
	0x006C,		// l - 6C
	0x006D,		// m - 6D
	0x006E,		// n - 6E
	0x006F,		// o - 6F
	// 111xxxx
	0x0070,		// p - 70
	0x0071,		// q - 71
	0x0072,		// r - 72
	0x0073,		// s - 73
	0x0074,		// t - 74
	0x0075,		// u - 75
	0x0076,		// v - 76
	0x0077,		// w - 77
	0x0078,		// x - 78
	0x0079,		// y - 79
	0x007A,		// z - 7A
	0x00E4,		// ä - 7B
	0x00F6,		// ö - 7C
	0x00F1,		// ñ - 7D
	0x00FC,		// ü - 7E
	0x00E0		// à - 7F
};

const u_int16_t gsm_7bit_default_extension[] = {
	// 000xxxx
	0x0040,		// @ - 00
	0x00A3,		// £ - 01
	0x0024,		// $ - 02
	0x00A5,		// ¥ - 03
	0x00E8,		// è - 04
	0x00E9,		// é - 05
	0x00F9,		// ù - 06
	0x00EC,		// ì - 07
	0x00F2,		// ò - 08
	0x00E7,		// ç - 09
	0x000A,		// LF- 0A - ext!
	0x00D8,		// Ø - 0B
	0x00F8,		// ø - 0C
	0x000D,		// CR- 0D
	0x00C5,		// Å - 0E
	0x00E5,		// å - 0F
	// 001xxxx
	0x0394,		// Δ - 10
	0x005F,		// _ - 11
	0x03A6,		// Φ - 12
	0x0393,		// Γ - 13
	0x005E,		//   - 14 - ext!
	0x03A9,		// Ω - 15
	0x03A0,		// Π - 16
	0x03A8,		// Ψ - 17
	0x03A3,		// Σ - 18
	0x0398,		// Θ - 19
	0x039E,		// Ξ - 1A
	0x0020,		//   - 1B - ext!
	0x00C6,		// Æ - 1C
	0x00E6,		// æ - 1D
	0x00DF,		// ß - 1E
	0x00C9,		// É - 1F
	// 010xxxx
	0x0020,		// SP- 20
	0x0021,		// ! - 21
	0x0022,		// " - 22
	0x0023,		// # - 23
	0x00A4,		// ¤ - 24
	0x0025,		// % - 25
	0x0026,		// & - 26
	0x0027,		// ' - 27
	0x007B,		//   - 28 - ext!
	0x007D,		//   - 29 - ext!
	0x002A,		// * - 2A
	0x002B,		// + - 2B
	0x002C,		// , - 2C
	0x002D,		// - - 2D
	0x002E,		// . - 2E
	0x005C,		//   - 2F - ext!
	// 011xxxx
	0x0030,		// 0 - 30
	0x0031,		// 1 - 31
	0x0032,		// 2 - 32
	0x0033,		// 3 - 33
	0x0034,		// 4 - 34
	0x0035,		// 5 - 35
	0x0036,		// 6 - 36
	0x0037,		// 7 - 37
	0x0038,		// 8 - 38
	0x0039,		// 9 - 39
	0x003A,		// : - 3A
	0x003B,		// ; - 3B
	0x005B,		//   - 3C - ext!
	0x007E,		//   - 3D - ext!
	0x005D,		//   - 3E - ext!
	0x003F,		// ? - 3F
	// 100xxxx
	0x007C,		//   - 40 - ext!
	0x0041,		// A - 41
	0x0042,		// B - 42
	0x0043,		// C - 43
	0x0044,		// D - 44
	0x0045,		// E - 45
	0x0046,		// F - 46
	0x0047,		// G - 47
	0x0048,		// H - 48
	0x0049,		// I - 49
	0x004A,		// J - 4A
	0x004B,		// K - 4B
	0x004C,		// L - 4C
	0x004D,		// M - 4D
	0x004E,		// N - 4E
	0x004F,		// O - 4F
	// 101xxxx
	0x0050,		// P - 50
	0x0051,		// Q - 51
	0x0052,		// R - 52
	0x0053,		// S - 53
	0x0054,		// T - 54
	0x0055,		// U - 55
	0x0056,		// V - 56
	0x0057,		// W - 57
	0x0058,		// X - 58
	0x0059,		// Y - 59
	0x005A,		// Z - 5A
	0x00C4,		// Ä - 5B
	0x00D6,		// Ö - 5C
	0x00D1,		// Ñ - 5D
	0x00DC,		// Ü - 5E
	0x00A7,		// § - 5F
	// 110xxxx
	0x00BF,		// ¿ - 60
	0x0061,		// a - 61
	0x0062,		// b - 62
	0x0063,		// c - 63
	0x0064,		// d - 64
	0x20AC,		//   - 65 - ext!
	0x0066,		// f - 66
	0x0067,		// g - 67
	0x0068,		// h - 68
	0x0069,		// i - 69
	0x006A,		// j - 6A
	0x006B,		// k - 6B
	0x006C,		// l - 6C
	0x006D,		// m - 6D
	0x006E,		// n - 6E
	0x006F,		// o - 6F
	// 111xxxx
	0x0070,		// p - 70
	0x0071,		// q - 71
	0x0072,		// r - 72
	0x0073,		// s - 73
	0x0074,		// t - 74
	0x0075,		// u - 75
	0x0076,		// v - 76
	0x0077,		// w - 77
	0x0078,		// x - 78
	0x0079,		// y - 79
	0x007A,		// z - 7A
	0x00E4,		// ä - 7B
	0x00F6,		// ö - 7C
	0x00F1,		// ñ - 7D
	0x00FC,		// ü - 7E
	0x00E0		// à - 7F
};

//------------------------------------------------------------------------------
// gsm_decode_GSM7_symbol()
//------------------------------------------------------------------------------
u_int16_t gsm_decode_GSM7_symbol(u_int8_t gsm7) {
	if (gsm7 & 0x80) {
		return 0x003F;
	} else {
		return gsm_7bit_default_main[gsm7];
	}
}
//------------------------------------------------------------------------------
// end of gsm_decode_GSM7_symbol()
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// unpackGSM7()
//------------------------------------------------------------------------------
char *unpackGSM7(const u_int8_t *input, size_t inplen, u_int8_t shift)
{
	char *output = NULL;
	u_int16_t ucs2buf[320];
	size_t length;
	u_int8_t carry = 0;
	u_int8_t octet = 0;
	u_int8_t symbol = 0;
	int extension = 0;
	size_t start = 0;
	size_t i = 0, j = 0, k = 0;

	char *ibuf, *obuf;
	size_t ilen, olen;
	iconv_t tc;
	size_t res;

	if (!input) {
		goto unpackGSM7_error;
	}
	if (!(output = malloc(640))) {
		goto unpackGSM7_error;
	}
	memset(output, 0, 640);

	length = (inplen * 8) / 7;

	shift %= 7;
	if (shift == 6) {
		shift += 1;
		carry = input[j] >> 1;
		j += 1;
	}
	if (shift == 5) {
		length += 1;
	}

	for (; i < length; i++) {

		if ((i + shift + 1) % 8) {
			octet = (i + shift) % 8;
			symbol = ((input[j] << octet) + carry) & 127;
			carry = input[j] >> (7 - octet);
			j += 1;
		} else {
			symbol = carry & 127;
			carry = 0;
		}

		if (symbol == 0x1B) {
			extension = 1;
			continue;
		}

		if (extension) {
			ucs2buf[k++] = gsm_7bit_default_extension[symbol];
			extension = 0;
		} else {
			ucs2buf[k++] = gsm_7bit_default_main[symbol];
		}
	}

	if ((shift > 0) && (shift < 7)) {
		start = 1;
		k--;
	}

	tc = iconv_open("UTF-8", "UCS-2LE");
	if (tc == (iconv_t)-1) {
		goto unpackGSM7_error;
	}

	ibuf = (char *)&ucs2buf[start];
	ilen = k;
	obuf = output;
	olen = 640;
	res = iconv(tc, &ibuf, &ilen, &obuf, &olen);
	if (res == (size_t)-1) {
		iconv_close(tc);
		goto unpackGSM7_error;
	}

	iconv_close(tc);

	return output;

unpackGSM7_error:
	if (output) {
		free(output);
	}
	return NULL;
}
//------------------------------------------------------------------------------
// end of unpackGSM7()
//------------------------------------------------------------------------------

/******************************************************************************/
/* end of 3gpp_ts_23_038.c                                                    */
/******************************************************************************/
